[
  {
    "path": "posts/2022-01-11-new-distill-site-in-15-minutes/",
    "title": "New distill site in 15 minutes",
    "description": "Distill is so much easier than blogdown",
    "author": [
      {
        "name": "David Harper",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-01-11",
    "categories": [],
    "contents": "\r\nMy current (soon previous) data blog is a blogdown site. But blogdown is a PITA to maintain; e.g., new plots broke on the last package update. On Sunday after hours trying to fix the blogdown configuration, I even resorted to hiring quick help at codementor.com for the first time in my life, but even their expert could not fix the problem. The first time it was pretty straightforward, and it should still be, but after searching to debug my problem, I observed that I was not alone in my frustration with blogdown. I figured, there MUST be a better way to simply share data analyses (without going to Rpubs, I mean)?\r\nThen I stumbled onto Lisa Lendway’s post. She also had a “blogdown fail!” and she explains why she switched to the distill package. How did I miss this revelation?! Boom. This setup here took me a grand total of 15 minutes to install. No glitches! Distill is light-weight and somewhat customizable; e.g., I borrowed the tidymodels.css stylesheet and changed my titles to CeriFi’s color (#193053) because, you know, color makes me happy. No mess. No fuss. Here are the basic steps:\r\nInstall distill package and build site with create_website (one line of code)\r\nCreate a local git repo (at the directory we just created) and connect that to a remote GitHub repo; mine is here and so this github repo is basically a copy of this webite\r\nUse the netlify to publish from the _site sub-directory. If Netflify goes public, I will be buying their shares :)\r\nDetailed steps TBD here\r\nCreate Distill Blog dialogLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-12T20:56:31-08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to DH (BT) blog",
    "description": "Welcome to our new blog, DH (BT) blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "David Harper",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2022-01-10",
    "categories": [],
    "contents": "\r\n\r\n\r\nknitr::opts_chunk$set(echo = TRUE)\r\n\r\n# Learn more about creating blogs with Distill at:\r\n# https://rstudio.github.io/distill/blog.html\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-01-10T19:43:03-08:00",
    "input_file": {}
  }
]
